proxy/public/product-details-service/stresstesting.yml
# artillery run stresstesting.yml

config:
  target: 'http://localhost:8000'
  phases:
    - duration: 100
      arrivalRate: 1800
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: '/shoes/:id'
    - post:
        url: '/shoes/10000001'